package com.yikangcheng.admin.yikang.activity.liveambitus.city;

/**
 * Created by YH on 2016/10/19.
 */

public class City {
    public static String[] stringCitys = new String[]{
            "郑州市", "洛阳市", "焦作市", "商丘市", "信阳市", "周口市", "鹤壁市", "安阳市",
            "濮阳市", "驻马店市", "南阳市", "开封市", "漯河市", "许昌市", "新乡市", "济源市",
            "灵宝市", "偃师市", "邓州市", "登封市", "三门峡市", "新郑市", "禹州市", "巩义市",
            "永城市", "长葛市", "义马市", "林州市", "项城市", "汝州市", "荥阳市",
            "平顶山市", "卫辉市", "辉县市", "舞钢市", "新密市", "孟州市", "沁阳市",
            "郏县", "合肥市", "亳州市", "芜湖市", "马鞍山市", "池州市", "黄山市",
            "滁州市", "安庆市", "淮南市", "淮北市", "蚌埠市", "宿州市", "宣城市",
            "六安市", "阜阳市", "铜陵市", "明光市", "天长市", "宁国市", "界首市",
            "桐城市", "潜山市", "福州市", "厦门市", "泉州市", "漳州市", "南平市",
            "三明市", "龙岩市", "莆田市", "宁德市", "建瓯市", "武夷山市", "长乐市", "福清市",
            "晋江市", "南安市", "福安市", "龙海市", "邵武市", "石狮市", "福鼎市", "建阳市",
            "漳平市", "永安市", "兰州市", "白银市", "武威市", "金昌市", "平凉市", "张掖市",
            "嘉峪关市", "酒泉市", "庆阳市", "定西市", "陇南市", "天水市", "玉门市", "临夏市",
            "合作市", "敦煌市", "甘南州", "贵阳市", "安顺市", "遵义市", "六盘水市", "兴义市",
            "都匀市", "凯里市", "毕节市", "清镇市", "铜仁市", "赤水市", "仁怀市", "福泉市",
            "海口市", "三亚市", "万宁市", "文昌市", "儋州市", "琼海市", "东方市", "五指山市",
            "嘉峪关市", "酒泉市", "庆阳市", "定西市", "陇南市", "天水市", "玉门市", "临夏市",
            "石家庄市", "保定市", "唐山市", "邯郸市", "邢台市", "沧州市", "衡水市", "廊坊市",
            "承德市", "迁安市", "鹿泉市", "秦皇岛市", "南宫市", "任丘市", "叶城市", "辛集市",
            "涿州市", "定州市", "晋州市", "霸州市", "黄骅市", "遵化市", "张家口市", "沙河市",
            "三河市", "冀州市", "武安市", "河间市", "深州市", "新乐市", "泊头市", "安国市",
            "双滦区", "高碑店市"
    };

    private String cityPinyin;
    private String cityName;
    private String firstPinYin;


    public String getCityPinyin() {
        return cityPinyin;
    }

    public void setCityPinyin(String cityPinyin) {
        this.cityPinyin = cityPinyin;
    }

    public String getCityName() {
        return cityName;
    }

    public void setCityName(String cityName) {
        this.cityName = cityName;
    }


    public String getFirstPinYin() {
        firstPinYin = cityPinyin.substring(0, 1);
        return firstPinYin;
    }
}
